 # ***Explore Data***

In [24]:
# Import packages
from sqlalchemy import create_engine
import pandas as pd

# Connect to the SQLite database
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

# Load data from a table into a DataFrame
df = pd.read_sql_query('SELECT * FROM Members', engine)

# Display the DataFrame
print(df)

    memid            surname  firstname  \
0       0              GUEST      GUEST
1       1              Smith     Darren
2       2              Smith      Tracy
3       3             Rownam        Tim
4       4           Joplette     Janice
5       5            Butters     Gerald
6       6              Tracy     Burton
7       7               Dare      Nancy
8       8             Boothe        Tim
9       9           Stibbons     Ponder
10     10               Owen    Charles
11     11              Jones      David
12     12              Baker       Anne
13     13            Farrell     Jemima
14     14              Smith       Jack
15     15              Bader   Florence
16     16              Baker    Timothy
17     17             Pinker      David
18     20            Genting    Matthew
19     21          Mackenzie       Anna
20     22             Coplin       Joan
21     24             Sarwin  Ramnaresh
22     26              Jones    Douglas
23     27             Rumney  Henrietta
24     28            Farrell      David
25     29  Worthington-Smyth      Henry
26     30            Purview  Millicent
27     33         Tupperware   Hyacinth
28     35               Hunt       John
29     36            Crumpet      Erica
30     37              Smith     Darren

                                    address  zipcode       telephone  \
0                                     GUEST        0  (000) 000-0000
1                8 Bloomsbury Close, Boston     4321    555-555-5555
2              8 Bloomsbury Close, New York     4321    555-555-5555
3                    23 Highway Way, Boston    23423  (844) 693-0723
4                20 Crossing Road, New York      234  (833) 942-4710
5            1065 Huntingdon Avenue, Boston    56754  (844) 078-4130
6                   3 Tunisia Drive, Boston    45678  (822) 354-9973
7               6 Hunting Lodge Way, Boston    10383  (833) 776-4001
8        3 Bloomsbury Close, Reading, 00234      234  (811) 433-2547
9                 5 Dragons Way, Winchester    87630  (833) 160-3900
10     52 Cheshire Grove, Winchester, 28563    28563  (855) 542-5251
11                 976 Gnats Close, Reading    33862  (844) 536-8036
12                55 Powdery Street, Boston    80743    844-076-5141
13          103 Firth Avenue, North Reading    57392  (855) 016-0163
14               252 Binkington Way, Boston    69302  (822) 163-3254
15               264 Ursula Drive, Westford    84923  (833) 499-3527
16                329 James Street, Reading    58393    833-941-0824
17                   5 Impreza Road, Boston    65332    811 409-6734
18    4 Nunnington Place, Wingfield, Boston    52365  (811) 972-1377
19              64 Perkington Lane, Reading    64577  (822) 661-2898
20      85 Bard Street, Bloomington, Boston    43533  (822) 499-2232
21               12 Bullington Lane, Boston    65464  (822) 413-1470
22                 976 Gnats Close, Reading    11986    844 536-8036
23               3 Burkington Plaza, Boston    78533  (822) 989-8876
24          437 Granite Farm Road, Westford    43532  (855) 755-9876
25              55 Jagbi Way, North Reading    97676  (855) 894-3758
26   641 Drudgery Close, Burnington, Boston    34232  (855) 941-9786
27  33 Cheerful Plaza, Drake Road, Westford    68666  (822) 665-5327
28                5 Bullington Lane, Boston    54333  (899) 720-6978
29              Crimson Road, North Reading    75655  (811) 732-4816
30           3 Funktown, Denzington, Boston    66796  (822) 577-3541

   recommendedby             joindate
0                 2012-07-01 00:00:00
1                 2012-07-02 12:02:05
2                 2012-07-02 12:08:23
3                 2012-07-03 09:32:15
4              1  2012-07-03 10:25:05
5              1  2012-07-09 10:44:09
6                 2012-07-15 08:52:55
7              4  2012-07-25 08:59:12
8              3  2012-07-25 16:02:35
9              6  2012-07-25 17:09:05
10             1  2012-08-03 19:42:37
11             4  2012-08-06 16:32:55
12             9  2012-08-10 14:23:22
13                2012-08-10 14:28:01
14             1  2012-08-10 16:22:05
15             9  2012-08-10 17:52:03
16            13  2012-08-15 10:34:25
17            13  2012-08-16 11:32:47
18             5  2012-08-19 14:55:55
19             1  2012-08-26 09:32:05
20            16  2012-08-29 08:32:41
21            15  2012-09-01 08:44:42
22            11  2012-09-02 18:43:05
23            20  2012-09-05 08:42:35
24                2012-09-15 08:22:05
25             2  2012-09-17 12:27:15
26             2  2012-09-18 19:04:01
27                2012-09-18 19:32:05
28            30  2012-09-19 11:32:45
29             2  2012-09-22 08:36:38
30                2012-09-26 18:08:45

In [25]:

df.head(5)

,memid,surname,firstname,address,zipcode,telephone,recommendedby,joindate
0,0,GUEST,GUEST,GUEST,0,(000) 000-0000,,2012-07-01 00:00:00
1,1,Smith,Darren,"8 Bloomsbury Close, Boston",4321,555-555-5555,,2012-07-02 12:02:05
2,2,Smith,Tracy,"8 Bloomsbury Close, New York",4321,555-555-5555,,2012-07-02 12:08:23
3,3,Rownam,Tim,"23 Highway Way, Boston",23423,(844) 693-0723,,2012-07-03 09:32:15
4,4,Joplette,Janice,"20 Crossing Road, New York",234,(833) 942-4710,1,2012-07-03 10:25:05

In [30]:
# Query the Bookings table
bookings_df = pd.read_sql_query('SELECT * FROM Bookings', engine)

In [31]:
bookings_df.head(5)

   bookid  facid  memid            starttime  slots
0       0      3      1  2012-07-03 11:00:00      2
1       1      4      1  2012-07-03 08:00:00      2
2       2      6      0  2012-07-03 18:00:00      2
3       3      7      1  2012-07-03 19:00:00      2
4       4      8      1  2012-07-03 10:00:00      1

In [33]:
# Query the Bookings table
facilities_df = pd.read_sql_query('SELECT * FROM Facilities', engine)

In [34]:
facilities_df.head(5)

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,2,Badminton Court,0.0,15.5,4000,50
3,3,Table Tennis,0.0,5.0,320,10
4,4,Massage Room 1,9.9,80.0,4000,3000

## Q1: Some of the facilities charge a fee to members, but some do not. Write a SQL query to produce a list of the names of the facilities that do.

In [36]:
# Query to find facilities that charge a fee to members
query = """
SELECT name 
FROM Facilities 
WHERE membercost > 0;
"""

# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, engine)

# Display the result
print(result_df)

             name
0  Tennis Court 1
1  Tennis Court 2
2  Massage Room 1
3  Massage Room 2
4    Squash Court

## Q2: How many facilities do not charge a fee to members?

In [38]:
# Query to count facilities without fee to members
query = """
SELECT COUNT(*) AS num_facilities_without_fee
FROM Facilities 
WHERE membercost = 0;
"""

# Execute the query and load the result into a DataFrame
result_df = pd.read_sql_query(query, engine)

# Display the result
print("Number of facilities without a fee to members:", result_df['num_facilities_without_fee'].iloc[0])

Number of facilities without a fee to members: 4

## Q3: Write an SQL query to show a list of facilities that charge a fee to members,where the fee is less than 20% of the facility's monthly maintenance cost.Return the facid, facility name, member cost, and monthly maintenance of the facilities in question.

In [39]:
# Query to show facilities that charge a fee to members where the fee is less than 20% of the monthly maintenance cost
query = """
SELECT facid, name, membercost, monthlymaintenance 
FROM Facilities 
WHERE membercost > 0 
AND membercost < (monthlymaintenance * 0.2);
"""

# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, engine)

# Display the result
print(result_df)

   facid            name  membercost  monthlymaintenance
0      0  Tennis Court 1         5.0                 200
1      1  Tennis Court 2         5.0                 200
2      4  Massage Room 1         9.9                3000
3      5  Massage Room 2         9.9                3000
4      6    Squash Court         3.5                  80

## Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5. Try writing the query without using the OR operator.

In [40]:
# Query to retrieve the details of facilities with ID 1 and 5
query = """
SELECT *
FROM Facilities 
WHERE facid IN (1, 5);
"""

# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, engine)

# Display the result
print(result_df)

   facid            name  membercost  guestcost  initialoutlay  \
0      1  Tennis Court 2         5.0         25           8000
1      5  Massage Room 2         9.9         80           4000

   monthlymaintenance
0                 200
1                3000

## Q5: Produce a list of facilities, with each labelled as 'cheap' or 'expensive', depending on if their monthly maintenance cost is more than $100. Return the name and monthly maintenance of the facilities in question.

In [41]:
# Query to produce a list of facilities labeled as 'cheap' or 'expensive'
query = """
SELECT 
    name,
    monthlymaintenance,
    CASE 
        WHEN monthlymaintenance > 100 THEN 'expensive'
        ELSE 'cheap'
    END AS cost_label
FROM 
    Facilities;
"""

# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, engine)

# Display the result
print(result_df)

              name  monthlymaintenance cost_label
0   Tennis Court 1                 200  expensive
1   Tennis Court 2                 200  expensive
2  Badminton Court                  50      cheap
3     Table Tennis                  10      cheap
4   Massage Room 1                3000  expensive
5   Massage Room 2                3000  expensive
6     Squash Court                  80      cheap
7    Snooker Table                  15      cheap
8       Pool Table                  15      cheap

## Q6: You'd like to get the first and last name of the last member(s) who signed up. Try not to use the LIMIT clause for your solution.

In [42]:
# Query to retrieve the first and last name of the last member(s) who signed up
query = """
SELECT firstname, surname
FROM Members
WHERE joindate = (SELECT MAX(joindate) FROM Members);
"""

# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, engine)

# Display the result
print(result_df)

  firstname surname
0    Darren   Smith

## Q7: Produce a list of all members who have used a tennis court. Include in your output the name of the court, and the name of the member formatted as a single column. Ensure no duplicate data, and order by the member name.

In [45]:
# Query to produce a list of all members who have used a tennis court
query = """
SELECT DISTINCT Members.firstname || ' ' || Members.surname AS member_name,
                Facilities.name AS tennis_court
FROM Bookings
JOIN Facilities ON Bookings.facid = Facilities.facid
JOIN Members ON Bookings.memid = Members.memid
WHERE Facilities.name LIKE 'Tennis Court%'
ORDER BY member_name;
"""

# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, engine)

# Display the result
print(result_df)

          member_name    tennis_court
0          Anne Baker  Tennis Court 1
1          Anne Baker  Tennis Court 2
2        Burton Tracy  Tennis Court 2
3        Burton Tracy  Tennis Court 1
4        Charles Owen  Tennis Court 1
5        Charles Owen  Tennis Court 2
6        Darren Smith  Tennis Court 2
7       David Farrell  Tennis Court 1
8       David Farrell  Tennis Court 2
9         David Jones  Tennis Court 2
10        David Jones  Tennis Court 1
11       David Pinker  Tennis Court 1
12      Douglas Jones  Tennis Court 1
13      Erica Crumpet  Tennis Court 1
14     Florence Bader  Tennis Court 2
15     Florence Bader  Tennis Court 1
16        GUEST GUEST  Tennis Court 2
17        GUEST GUEST  Tennis Court 1
18     Gerald Butters  Tennis Court 1
19     Gerald Butters  Tennis Court 2
20   Henrietta Rumney  Tennis Court 2
21         Jack Smith  Tennis Court 1
22         Jack Smith  Tennis Court 2
23    Janice Joplette  Tennis Court 1
24    Janice Joplette  Tennis Court 2
25     Jemima Farrell  Tennis Court 2
26     Jemima Farrell  Tennis Court 1
27        Joan Coplin  Tennis Court 1
28          John Hunt  Tennis Court 1
29          John Hunt  Tennis Court 2
30    Matthew Genting  Tennis Court 1
31  Millicent Purview  Tennis Court 2
32         Nancy Dare  Tennis Court 2
33         Nancy Dare  Tennis Court 1
34    Ponder Stibbons  Tennis Court 2
35    Ponder Stibbons  Tennis Court 1
36   Ramnaresh Sarwin  Tennis Court 2
37   Ramnaresh Sarwin  Tennis Court 1
38         Tim Boothe  Tennis Court 2
39         Tim Boothe  Tennis Court 1
40         Tim Rownam  Tennis Court 2
41         Tim Rownam  Tennis Court 1
42      Timothy Baker  Tennis Court 2
43      Timothy Baker  Tennis Court 1
44        Tracy Smith  Tennis Court 1
45        Tracy Smith  Tennis Court 2

## Q8: Produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30. Remember that guests have different costs to members (the listed costs are per half-hour 'slot'), and the guest user's ID is always 0. Include in your output the name of the facility, the name of the member formatted as a single column, and the cost. Order by descending cost, and do not use any subqueries.

In [50]:
# Query to produce a list of bookings on the day of 2012-09-14 costing more than $30
query = """
SELECT 
    Facilities.name AS facility_name,
    Members.firstname || ' ' || Members.surname AS member_name,
    CASE 
        WHEN Bookings.memid = 0 THEN Bookings.slots * Facilities.guestcost
        ELSE Bookings.slots * Facilities.membercost
    END AS cost
FROM 
    Bookings
JOIN 
    Facilities ON Bookings.facid = Facilities.facid
LEFT JOIN 
    Members ON Bookings.memid = Members.memid
WHERE 
    Bookings.starttime LIKE '2012-09-14%' 
    AND (
        (Bookings.memid = 0 AND Bookings.slots * Facilities.guestcost > 30)
        OR
        (Bookings.memid != 0 AND Bookings.slots * Facilities.membercost > 30)
    )
ORDER BY 
    cost DESC;
"""

# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, engine)

# Display the result
print(result_df)

     facility_name     member_name   cost
0   Massage Room 2     GUEST GUEST  320.0
1   Massage Room 1     GUEST GUEST  160.0
2   Massage Room 1     GUEST GUEST  160.0
3   Massage Room 1     GUEST GUEST  160.0
4   Tennis Court 2     GUEST GUEST  150.0
5   Tennis Court 1     GUEST GUEST   75.0
6   Tennis Court 1     GUEST GUEST   75.0
7   Tennis Court 2     GUEST GUEST   75.0
8     Squash Court     GUEST GUEST   70.0
9   Massage Room 1  Jemima Farrell   39.6
10    Squash Court     GUEST GUEST   35.0
11    Squash Court     GUEST GUEST   35.0

## Q9: This time, produce the same result as in Q8, but using a subquery.

In [53]:
# Query to produce the same result as in Q8 using a subquery
query = """
SELECT 
    Members.firstname || ' ' || Members.surname AS september_fourteen_bookings,
    cost
FROM (
    SELECT 
        Bookings.memid,
        Facilities.name,
        CASE 
            WHEN Bookings.memid = 0 THEN Bookings.slots * Facilities.guestcost
            ELSE Bookings.slots * Facilities.membercost
        END AS cost
    FROM 
        Bookings
    JOIN 
        Facilities ON Bookings.facid = Facilities.facid
    WHERE 
        Bookings.starttime LIKE '2012-09-14%' 
        AND (
            (Bookings.memid = 0 AND Bookings.slots * Facilities.guestcost > 30)
            OR
            (Bookings.memid != 0 AND Bookings.slots * Facilities.membercost > 30)
        )
) AS subquery
LEFT JOIN 
    Members ON subquery.memid = Members.memid
ORDER BY 
    cost DESC;
"""


# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, engine)

# Display the result
print(result_df)

   september_fourteen_bookings   cost
0                  GUEST GUEST  320.0
1                  GUEST GUEST  160.0
2                  GUEST GUEST  160.0
3                  GUEST GUEST  160.0
4                  GUEST GUEST  150.0
5                  GUEST GUEST   75.0
6                  GUEST GUEST   75.0
7                  GUEST GUEST   75.0
8                  GUEST GUEST   70.0
9               Jemima Farrell   39.6
10                 GUEST GUEST   35.0
11                 GUEST GUEST   35.0

# Part 2

In [56]:
# Import necessary libraries
import sqlite3

# Connect to SQLite database
conn = sqlite3.connect('country_club.db')

# Create a cursor object
cursor = conn.cursor()

# Execute SQL queries using the cursor object
cursor.execute("SELECT * FROM Members LIMIT 5")
rows = cursor.fetchall()
for row in rows:
    print(row)

cursor.execute("SELECT * FROM Facilities LIMIT 5")
rows = cursor.fetchall()
for row in rows:
    print(row)

cursor.execute("SELECT * FROM Bookings LIMIT 5")
rows = cursor.fetchall()
for row in rows:
    print(row)

(0, 'GUEST', 'GUEST', 'GUEST', 0, '(000) 000-0000', '', '2012-07-01 00:00:00')
(1, 'Smith', 'Darren', '8 Bloomsbury Close, Boston', 4321, '555-555-5555', '', '2012-07-02 12:02:05')
(2, 'Smith', 'Tracy', '8 Bloomsbury Close, New York', 4321, '555-555-5555', '', '2012-07-02 12:08:23')
(3, 'Rownam', 'Tim', '23 Highway Way, Boston', 23423, '(844) 693-0723', '', '2012-07-03 09:32:15')
(4, 'Joplette', 'Janice', '20 Crossing Road, New York', 234, '(833) 942-4710', '1', '2012-07-03 10:25:05')
(0, 'Tennis Court 1', 5, 25, 10000, 200)
(1, 'Tennis Court 2', 5, 25, 8000, 200)
(2, 'Badminton Court', 0, 15.5, 4000, 50)
(3, 'Table Tennis', 0, 5, 320, 10)
(4, 'Massage Room 1', 9.9, 80, 4000, 3000)
(0, 3, 1, '2012-07-03 11:00:00', 2)
(1, 4, 1, '2012-07-03 08:00:00', 2)
(2, 6, 0, '2012-07-03 18:00:00', 2)
(3, 7, 1, '2012-07-03 19:00:00', 2)
(4, 8, 1, '2012-07-03 10:00:00', 1)

## Q10: Produce a list of facilities with a total revenue less than 1000. The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members!

In [57]:
# Query to produce a list of facilities with total revenue less than 1000
query = """
SELECT 
    Facilities.name AS facility_name,
    SUM(
        CASE 
            WHEN Bookings.memid = 0 THEN Bookings.slots * Facilities.guestcost
            ELSE Bookings.slots * Facilities.membercost
        END
    ) AS total_revenue
FROM 
    Bookings
JOIN 
    Facilities ON Bookings.facid = Facilities.facid
GROUP BY 
    Facilities.name
HAVING 
    total_revenue < 1000
ORDER BY 
    total_revenue;
"""

# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

   facility_name  total_revenue
0   Table Tennis            180
1  Snooker Table            240
2     Pool Table            270

## Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [64]:
# Import necessary libraries
import sqlite3

# Connect to SQLite database
conn = sqlite3.connect('country_club.db')

# Query to produce the report of members and who recommended them
query = """
SELECT 
    m1.surname || ',' || m1.firstname AS member_name,
    m2.surname || ',' || m2.firstname AS recommended_by
FROM 
    Members AS m1
LEFT JOIN 
    Members AS m2 ON m1.recommendedby = m2.memid
ORDER BY 
    m1.surname, m1.firstname;
"""

# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

                member_name     recommended_by
0            Bader,Florence    Stibbons,Ponder
1                Baker,Anne    Stibbons,Ponder
2             Baker,Timothy     Farrell,Jemima
3                Boothe,Tim         Rownam,Tim
4            Butters,Gerald       Smith,Darren
5               Coplin,Joan      Baker,Timothy
6             Crumpet,Erica        Smith,Tracy
7                Dare,Nancy    Joplette,Janice
8             Farrell,David               None
9            Farrell,Jemima               None
10              GUEST,GUEST               None
11          Genting,Matthew     Butters,Gerald
12                Hunt,John  Purview,Millicent
13              Jones,David    Joplette,Janice
14            Jones,Douglas        Jones,David
15          Joplette,Janice       Smith,Darren
16           Mackenzie,Anna       Smith,Darren
17             Owen,Charles       Smith,Darren
18             Pinker,David     Farrell,Jemima
19        Purview,Millicent        Smith,Tracy
20               Rownam,Tim               None
21         Rumney,Henrietta    Genting,Matthew
22         Sarwin,Ramnaresh     Bader,Florence
23             Smith,Darren               None
24             Smith,Darren               None
25               Smith,Jack       Smith,Darren
26              Smith,Tracy               None
27          Stibbons,Ponder       Tracy,Burton
28             Tracy,Burton               None
29      Tupperware,Hyacinth               None
30  Worthington-Smyth,Henry        Smith,Tracy

## Q12: Find the facilities with their usage by member, but not guests

In [59]:
# Query to find the facilities with their usage by members, but not guests
query = """
SELECT 
    f.name AS facility_name,
    m.firstname || ' ' || m.surname AS member_name,
    COUNT(*) AS usage
FROM 
    Bookings AS b
JOIN 
    Facilities AS f ON b.facid = f.facid
JOIN 
    Members AS m ON b.memid = m.memid
WHERE 
    b.memid != 0
GROUP BY 
    facility_name, member_name;
"""

# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

       facility_name       member_name  usage
0    Badminton Court    Anna Mackenzie     30
1    Badminton Court        Anne Baker     10
2    Badminton Court      Burton Tracy      2
3    Badminton Court      Charles Owen      6
4    Badminton Court      Darren Smith    132
..               ...               ...    ...
197   Tennis Court 2  Ramnaresh Sarwin     11
198   Tennis Court 2        Tim Boothe     52
199   Tennis Court 2        Tim Rownam      6
200   Tennis Court 2     Timothy Baker      7
201   Tennis Court 2       Tracy Smith      2

[202 rows x 3 columns]

## Q13: Find the facilities usage by month, but not guests

In [65]:
# Query to find the facilities' usage by month, excluding guests
query = """
SELECT 
    strftime('%m', starttime) AS month,
    f.name AS facility_name,
    COUNT(*) AS usage
FROM 
    Bookings AS b
JOIN 
    Facilities AS f ON b.facid = f.facid
WHERE 
    b.memid != 0
GROUP BY 
    month, facility_name;
"""

# Execute the query and load the results into a DataFrame
result_df = pd.read_sql_query(query, conn)

# Display the result
print(result_df)

# Close the connection
conn.close()

   month    facility_name  usage
0     07  Badminton Court     51
1     07   Massage Room 1     77
2     07   Massage Room 2      4
3     07       Pool Table    103
4     07    Snooker Table     68
5     07     Squash Court     23
6     07     Table Tennis     48
7     07   Tennis Court 1     65
8     07   Tennis Court 2     41
9     08  Badminton Court    132
10    08   Massage Room 1    153
11    08   Massage Room 2      9
12    08       Pool Table    272
13    08    Snooker Table    154
14    08     Squash Court     85
15    08     Table Tennis    143
16    08   Tennis Court 1    111
17    08   Tennis Court 2    109
18    09  Badminton Court    161
19    09   Massage Room 1    191
20    09   Massage Room 2     14
21    09       Pool Table    408
22    09    Snooker Table    199
23    09     Squash Court     87
24    09     Table Tennis    194
25    09   Tennis Court 1    132
26    09   Tennis Court 2    126